# CheckServiceType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckServiceType Method
EnergyDataSettings Class See Also
---
Checks that the service type falls within an appropriate range.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CheckServiceType(
	gbXMLServiceType serviceType
)
```

Visual Basic
---
```text
Public Shared Function CheckServiceType ( _
	serviceType As gbXMLServiceType _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckServiceType(
	gbXMLServiceType serviceType
)
```

# ### Parameters
serviceType
    Type: Autodesk.Revit.DB.Analysis..::..gbXMLServiceType The service type to be checked.
# ### Return Value
True if the service type falls within an appropriate range, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace